In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv('/Users/terrygilmore/Desktop/Divvy_DB/Divvy_Stations_Trips_2014/Divvy_Trips_2014_Q1Q2.csv')
df2 = pd.read_csv('/Users/terrygilmore/Desktop/Divvy_DB/Divvy_Stations_Trips_2014/Divvy_Trips_2014-Q3-07.csv')
df3 = pd.read_csv('/Users/terrygilmore/Desktop/Divvy_DB/Divvy_Stations_Trips_2014/Divvy_Trips_2014-Q3-0809.csv')
df4 = pd.read_csv('/Users/terrygilmore/Desktop/Divvy_DB/Divvy_Stations_Trips_2014/Divvy_Trips_2014-Q4.csv')

In [3]:
df1.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 905699 entries, 0 to 905698
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            905699 non-null  int64
 1   starttime          905699 non-null  object
 2   stoptime           905699 non-null  object
 3   bikeid             905699 non-null  int64
 4   tripduration       905699 non-null  int64
 5   from_station_id    905699 non-null  int64
 6   from_station_name  905699 non-null  object
 7   to_station_id      905699 non-null  int64
 8   to_station_name    905699 non-null  object
 9   usertype           905699 non-null  object
 10  gender             591677 non-null  object
 11  birthyear          591722 non-null  float64
dtypes: float64(1), int64(5), object(6)
memory usage: 82.9+ MB

In [4]:
df1["starttime"] = pd.to_datetime(df1["starttime"])
df1["stoptime"] = pd.to_datetime(df1["stoptime"])

In [5]:
df1.loc[df1['gender'].isnull(), 'gender'] = 'Unknown'
df1.loc[df1['birthyear'].isnull(), 'birthyear'] = 0

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 905699 entries, 0 to 905698
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            905699 non-null  int64
 1   starttime          905699 non-null  datetime64[ns]
 2   stoptime           905699 non-null  datetime64[ns]
 3   bikeid             905699 non-null  int64
 4   tripduration       905699 non-null  int64
 5   from_station_id    905699 non-null  int64
 6   from_station_name  905699 non-null  object
 7   to_station_id      905699 non-null  int64
 8   to_station_name    905699 non-null  object
 9   usertype           905699 non-null  object
 10  gender             905699 non-null  object
 11  birthyear          905699 non-null  float64
dtypes: datetime64[ns](2), float64(1), int64(5), object(4)
memory usage: 82.9+ MB

In [7]:
df2.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 410340 entries, 0 to 410339
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            410340 non-null  int64
 1   starttime          410340 non-null  object
 2   stoptime           410340 non-null  object
 3   bikeid             410340 non-null  int64
 4   tripduration       410340 non-null  int64
 5   from_station_id    410340 non-null  int64
 6   from_station_name  410340 non-null  object
 7   to_station_id      410340 non-null  int64
 8   to_station_name    410340 non-null  object
 9   usertype           410340 non-null  object
 10  gender             251774 non-null  object
 11  birthyear          251745 non-null  float64
dtypes: float64(1), int64(5), object(6)
memory usage: 37.6+ MB

In [8]:
df2.loc[df2['gender'].isnull(), 'gender'] = 'Unknown'
df2.loc[df2['birthyear'].isnull(), 'birthyear'] = 0

In [9]:
df2["starttime"] = pd.to_datetime(df2["starttime"])
df2["stoptime"] = pd.to_datetime(df2["stoptime"])

In [10]:
df2.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 410340 entries, 0 to 410339
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            410340 non-null  int64
 1   starttime          410340 non-null  datetime64[ns]
 2   stoptime           410340 non-null  datetime64[ns]
 3   bikeid             410340 non-null  int64
 4   tripduration       410340 non-null  int64
 5   from_station_id    410340 non-null  int64
 6   from_station_name  410340 non-null  object
 7   to_station_id      410340 non-null  int64
 8   to_station_name    410340 non-null  object
 9   usertype           410340 non-null  object
 10  gender             410340 non-null  object
 11  birthyear          410340 non-null  float64
dtypes: datetime64[ns](2), float64(1), int64(5), object(4)
memory usage: 37.6+ MB

In [11]:
df3.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700630 entries, 0 to 700629
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            700630 non-null  int64
 1   starttime          700630 non-null  object
 2   stoptime           700630 non-null  object
 3   bikeid             700630 non-null  int64
 4   tripduration       700630 non-null  int64
 5   from_station_id    700630 non-null  int64
 6   from_station_name  700630 non-null  object
 7   to_station_id      700630 non-null  int64
 8   to_station_name    700630 non-null  object
 9   usertype           700630 non-null  object
 10  gender             451527 non-null  object
 11  birthyear          451540 non-null  float64
dtypes: float64(1), int64(5), object(6)
memory usage: 64.1+ MB

In [12]:
df3["starttime"] = pd.to_datetime(df3["starttime"])
df3["stoptime"] = pd.to_datetime(df3["stoptime"])

In [13]:
df3.loc[df3['gender'].isnull(), 'gender'] = 'Unknown'
df3.loc[df3['birthyear'].isnull(), 'birthyear'] = 0

In [14]:
df3.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700630 entries, 0 to 700629
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            700630 non-null  int64
 1   starttime          700630 non-null  datetime64[ns]
 2   stoptime           700630 non-null  datetime64[ns]
 3   bikeid             700630 non-null  int64
 4   tripduration       700630 non-null  int64
 5   from_station_id    700630 non-null  int64
 6   from_station_name  700630 non-null  object
 7   to_station_id      700630 non-null  int64
 8   to_station_name    700630 non-null  object
 9   usertype           700630 non-null  object
 10  gender             700630 non-null  object
 11  birthyear          700630 non-null  float64
dtypes: datetime64[ns](2), float64(1), int64(5), object(4)
memory usage: 64.1+ MB

In [15]:
df4.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 437965 entries, 0 to 437964
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            437965 non-null  int64
 1   starttime          437965 non-null  object
 2   stoptime           437965 non-null  object
 3   bikeid             437965 non-null  int64
 4   tripduration       437965 non-null  int64
 5   from_station_id    437965 non-null  int64
 6   from_station_name  437965 non-null  object
 7   to_station_id      437965 non-null  int64
 8   to_station_name    437965 non-null  object
 9   usertype           437965 non-null  object
 10  gender             368376 non-null  object
 11  birthyear          368411 non-null  float64
dtypes: float64(1), int64(5), object(6)
memory usage: 40.1+ MB

In [16]:
df4.head()

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthyear
0,4413167,12/31/2014 23:54,12/31/2014 23:57,1880,193,296,Broadway & Belmont Ave,334,Lake Shore Dr & Belmont Ave,Subscriber,Male,1989.0
1,4413166,12/31/2014 23:50,12/31/2014 23:52,1153,161,264,Stetson Ave & South Water St,44,State St & Randolph St,Subscriber,Male,1984.0
2,4413165,12/31/2014 23:48,1/1/2015 0:38,1946,3002,168,Michigan Ave & 14th St,168,Michigan Ave & 14th St,Customer,NaN,NaN
3,4413164,12/31/2014 23:46,1/1/2015 0:37,2563,3084,168,Michigan Ave & 14th St,168,Michigan Ave & 14th St,Subscriber,Male,1987.0
4,4413163,12/31/2014 23:44,1/1/2015 0:10,389,1570,43,Michigan Ave & Washington St,163,Damen Ave & Clybourn Ave,Subscriber,Male,1983.0

In [17]:
df4.tail()

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthyear
437960,3810756,10/1/2014 0:01,10/1/2014 0:16,1122,853,253,Clifton Ave & Lawrence Ave,114,Sheffield Ave & Addison St,Subscriber,Male,1980.0
437961,3810754,10/1/2014 0:02,10/1/2014 0:10,1531,468,113,Bissell St & Armitage Ave,340,Clark St & Wrightwood Ave,Subscriber,Male,1985.0
437962,3810753,10/1/2014 0:02,10/1/2014 0:16,2707,836,332,Halsted St & Diversey Pkwy,333,Ashland Ave & Blackhawk St,Subscriber,Male,1985.0
437963,3810752,10/1/2014 0:01,10/1/2014 0:05,2059,238,92,Carpenter St & Huron St,29,Noble St & Milwaukee Ave,Subscriber,Male,1986.0
437964,3810751,10/1/2014 0:00,10/1/2014 0:09,1316,538,52,Michigan Ave & Lake St,255,Indiana Ave & Roosevelt Rd,Subscriber,Male,1980.0

In [18]:
df4["starttime"] = pd.to_datetime(df4["starttime"])
df4["stoptime"] = pd.to_datetime(df4["stoptime"])

In [19]:
df4.loc[df4['gender'].isnull(), 'gender'] = 'Unknown'
df4.loc[df4['birthyear'].isnull(), 'birthyear'] = 0

In [20]:
df4.loc[df4['stoptime'].dt.year == 2015]

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthyear
2,4413165,2014-12-31 23:48:00,2015-01-01 00:38:00,1946,3002,168,Michigan Ave & 14th St,168,Michigan Ave & 14th St,Customer,Unknown,0.0
3,4413164,2014-12-31 23:46:00,2015-01-01 00:37:00,2563,3084,168,Michigan Ave & 14th St,168,Michigan Ave & 14th St,Subscriber,Male,1987.0
4,4413163,2014-12-31 23:44:00,2015-01-01 00:10:00,389,1570,43,Michigan Ave & Washington St,163,Damen Ave & Clybourn Ave,Subscriber,Male,1983.0

In [21]:
df4.drop([2, 3, 4], axis=0, inplace=True)

In [22]:
df4.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 437962 entries, 0 to 437964
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            437962 non-null  int64
 1   starttime          437962 non-null  datetime64[ns]
 2   stoptime           437962 non-null  datetime64[ns]
 3   bikeid             437962 non-null  int64
 4   tripduration       437962 non-null  int64
 5   from_station_id    437962 non-null  int64
 6   from_station_name  437962 non-null  object
 7   to_station_id      437962 non-null  int64
 8   to_station_name    437962 non-null  object
 9   usertype           437962 non-null  object
 10  gender             437962 non-null  object
 11  birthyear          437962 non-null  float64
dtypes: datetime64[ns](2), float64(1), int64(5), object(4)
memory usage: 43.4+ MB

In [23]:
df_2014 = pd.concat([df1, df2, df3, df4])

In [24]:
duplicate = df_2014[df_2014.duplicated()]

In [25]:
df_2014.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2454631 entries, 0 to 437964
Data columns (total 12 columns):
 #   Column             Dtype
---  ------             -----
 0   trip_id            int64
 1   starttime          datetime64[ns]
 2   stoptime           datetime64[ns]
 3   bikeid             int64
 4   tripduration       int64
 5   from_station_id    int64
 6   from_station_name  object
 7   to_station_id      int64
 8   to_station_name    object
 9   usertype           object
 10  gender             object
 11  birthyear          float64
dtypes: datetime64[ns](2), float64(1), int64(5), object(4)
memory usage: 243.5+ MB

In [26]:
df_2014.to_csv('2014_Clean.csv', index=False)

* concat and result in 1 cleaned CSVs. Revert from variables back to cleaned CSV.